jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
	wrqu = (struct iw_point*)wdata;
	pwrctrlpriv = adapter_to_pwrctl(padapter);
	pEfuseHal = &pHalData->EfuseHal;

	err = 0;
	data = rtw_zmalloc(EFUSE_BT_MAX_MAP_LEN);
	if (data == NULL)
	{
		err = -ENOMEM;
		goto exit;
	}
	rawdata = rtw_zmalloc(EFUSE_BT_MAX_MAP_LEN);
	if (rawdata == NULL)
	{
		err = -ENOMEM;
		goto exit;
	}

	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
	{
		err = -EFAULT;
		goto exit;
	}
	#ifdef CONFIG_LPS
	lps_mode = pwrctrlpriv->power_mgnt;//keep org value
	rtw_pm_set_lps(padapter,PS_MODE_ACTIVE);
	#endif	
	
	#ifdef CONFIG_IPS	
	ips_mode = pwrctrlpriv->ips_mode;//keep org value
	rtw_pm_set_ips(padapter,IPS_NONE);
	#endif	
	
	pch = extra;
	DBG_871X("%s: in=%s\n", __FUNCTION__, extra);

	i = 0;
	while ((token = strsep(&pch, ",")) != NULL)
	{
		if (i > 2) break;
		tmp[i] = token;
		i++;
	}
	#ifdef CONFIG_IOL
	padapter->registrypriv.fw_iol = 0;// 0:Disable, 1:enable, 2:by usb speed
	#endif
	
	if(strcmp(tmp[0], "status") == 0){
		sprintf(extra, "Load File efuse=%s,Load File MAC=%s",(pEEPROM->bloadfile_fail_flag? "FAIL" : "OK"),(pEEPROM->bloadmac_fail_flag? "FAIL" : "OK"));

		  goto exit;
	}
	else if (strcmp(tmp[0], "drvmap") == 0)
	{
		mapLen = EFUSE_MAP_SIZE;
		
		sprintf(extra, "\n");
		for (i = 0; i < EFUSE_MAP_SIZE; i += 16)
		{
			sprintf(extra, "%s0x%02x\t", extra, i);
			for (j=0; j<8; j++) {
				sprintf(extra, "%s%02X ", extra, PROMContent[i+j]);
			}
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
				sprintf(extra, "%s%02X ", extra, PROMContent[i+j]);
			}
			sprintf(extra,"%s\n",extra);
		}
	}
	else if (strcmp(tmp[0], "realmap") == 0)
	{
		mapLen = EFUSE_MAP_SIZE;
		if (rtw_efuse_map_read(padapter, EFUSE_WIFI , mapLen, pEfuseHal->fakeEfuseInitMap) == _FAIL)
		{
			DBG_871X("%s: read realmap Fail!!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		sprintf(extra, "\n");
		for (i = 0; i < EFUSE_MAP_SIZE; i += 16)
		{
			sprintf(extra, "%s0x%02x\t", extra, i);
			for (j=0; j<8; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeEfuseInitMap[i+j]);
			}
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeEfuseInitMap[i+j]);
			}
			sprintf(extra,"%s\n",extra);
		}
	}
	else if (strcmp(tmp[0], "rmap") == 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
		{
			DBG_871X("%s: rmap Fail!! Parameters error!\n", __FUNCTION__);
			err = -EINVAL;
			goto exit;
		}

		addr = simple_strtoul(tmp[1], &ptmp, 16);
		DBG_871X("%s: addr=%x\n", __FUNCTION__, addr);

		cnts = simple_strtoul(tmp[2], &ptmp, 10);
		if (cnts == 0)
		{
			DBG_871X("%s: rmap Fail!! cnts error!\n", __FUNCTION__);
			err = -EINVAL;
			goto exit;
		}
		DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);

		EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_EFUSE_MAP_LEN , (PVOID)&max_available_size, _FALSE);
		if ((addr+ cnts) > max_available_size)
		{
			DBG_871X("%s: addr(0x%X)+cnts(%d) parameter error!\n", __FUNCTION__, addr, cnts);
			err = -EINVAL;
			goto exit;
		}

		if (rtw_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_871X("%s: rtw_efuse_map_read error!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		*extra = 0;
		for (i=0; i<cnts; i++) {
			sprintf(extra, "%s0x%02X ", extra, data[i]);
		}
	}
	else if (strcmp(tmp[0], "realraw") == 0)
	{
		addr = 0;
		mapLen = EFUSE_MAX_SIZE;
		if (rtw_efuse_access(padapter, _FALSE, addr, mapLen, rawdata) == _FAIL)
		{
			DBG_871X("%s: rtw_efuse_access Fail!!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}
		_rtw_memset(extra,'\0',strlen(extra));
				sprintf(extra, "\n0x00\t");
				for (i=0; i< mapLen; i++)
				{
					sprintf(extra, "%s%02X", extra, rawdata[i]);
					if ((i & 0xF) == 0xF) {
						sprintf(extra, "%s\n", extra);
						sprintf(extra, "%s0x%02x\t", extra, i+1);
					}
					else if ((i & 0x7) == 0x7){
						sprintf(extra, "%s \t", extra);
					} else {
						sprintf(extra, "%s ", extra);
					}
				}
	}
	else if (strcmp(tmp[0], "mac") == 0)
	{
		#ifdef CONFIG_RTL8192C
		addr = EEPROM_MAC_ADDR_92C;
		#endif
		#ifdef CONFIG_RTL8192D
			#ifdef CONFIG_USB_HCI
			if (pHalData->interfaceIndex == 0)
				addr = EEPROM_MAC_ADDR_MAC0_92DU;
			else
				addr = EEPROM_MAC_ADDR_MAC1_92DU;
			#else
			if (pHalData->interfaceIndex == 0)
				addr = EEPROM_MAC_ADDR_MAC0_92DE;
			else
				addr = EEPROM_MAC_ADDR_MAC1_92DE;
			#endif
		#endif
		#ifdef CONFIG_RTL8723A
			#ifdef CONFIG_SDIO_HCI
			addr = EEPROM_MAC_ADDR_8723AS;
			#endif
			#ifdef CONFIG_GSPI_HCI
			addr = EEPROM_MAC_ADDR_8723AS;
			#endif
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_MAC_ADDR_8723AU;
			#endif
		#endif
		#ifdef CONFIG_RTL8188E
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_MAC_ADDR_88EU;
			#endif
			#ifdef CONFIG_SDIO_HCI
			addr = EEPROM_MAC_ADDR_88ES;
			#endif
			#ifdef CONFIG_PCI_HCI
			addr = EEPROM_MAC_ADDR_88EE;
			#endif
		#endif

		#ifdef CONFIG_RTL8192E
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_MAC_ADDR_8192EU;
			#endif
			#ifdef CONFIG_SDIO_HCI
			addr = EEPROM_MAC_ADDR_8192ES;
			#endif
			#ifdef CONFIG_PCI_HCI
			addr = EEPROM_MAC_ADDR_8192EE;
			#endif
		#endif
		#ifdef CONFIG_RTL8723B
		#ifdef CONFIG_SDIO_HCI
		addr = EEPROM_MAC_ADDR_8723BS;
		#endif
		#ifdef CONFIG_GSPI_HCI
		addr = EEPROM_MAC_ADDR_8723BS;
		#endif
		#ifdef CONFIG_USB_HCI
		addr = EEPROM_MAC_ADDR_8723BU;
		#endif
		#endif
		cnts = 6;

		EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size) {
			DBG_871X("%s: addr(0x%02x)+cnts(%d) parameter error!\n", __FUNCTION__, addr, cnts);
			err = -EFAULT;
			goto exit;
		}

		if (rtw_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_871X("%s: rtw_efuse_map_read error!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		*extra = 0;
		for (i=0; i<cnts; i++)
		{
			sprintf(extra, "%s%02X", extra, data[i]);
			if (i != (cnts-1))
			{
				sprintf(extra,"%s:",extra);
			}
		}
	}
	else if (strcmp(tmp[0], "vidpid") == 0)
	{
		#ifdef CONFIG_RTL8192C
		addr = EEPROM_VID_92C;
		#endif
		#ifdef CONFIG_RTL8192D
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_VID_92DU;
			#else
			addr = EEPROM_VID_92DE;
			#endif
		#endif
		#ifdef CONFIG_RTL8723A
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_VID_8723AU;
			#endif
		#endif
		#ifdef CONFIG_RTL8188E
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_VID_88EU;
			#endif
			#ifdef CONFIG_PCI_HCI
			addr = EEPROM_VID_88EE;
			#endif
		#endif

		#ifdef CONFIG_RTL8192E
			#ifdef CONFIG_USB_HCI
			addr = EEPROM_VID_8192EU;
			#endif
			#ifdef CONFIG_PCI_HCI
			addr = EEPROM_VID_8192EE;
			#endif
		#endif
		#ifdef CONFIG_RTL8723B
		addr = EEPROM_VID_8723BU;
		#endif
		cnts = 4;

		EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size)
		{
			DBG_871X("%s: addr(0x%02x)+cnts(%d) parameter error!\n", __FUNCTION__, addr, cnts);
			err = -EFAULT;
			goto exit;
		}
		if (rtw_efuse_map_read(padapter, addr, cnts, data) == _FAIL)
		{
			DBG_871X("%s: rtw_efuse_access error!!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		*extra = 0;
		for (i=0; i<cnts; i++)
		{
			sprintf(extra, "%s0x%02X", extra, data[i]);
			if (i != (cnts-1))
			{
				sprintf(extra,"%s,",extra);
			}
		}
	}
	else if (strcmp(tmp[0], "ableraw") == 0)
	{
		efuse_GetCurrentSize(padapter,&raw_cursize);
		raw_maxsize = efuse_GetMaxSize(padapter);
		sprintf(extra, "[available raw size]= %d bytes", raw_maxsize-raw_cursize);
	}
	else if (strcmp(tmp[0], "btfmap") == 0)
	{
		BTEfuse_PowerSwitch(padapter,1,_TRUE);
				
		mapLen = EFUSE_BT_MAX_MAP_LEN;
		if (rtw_BT_efuse_map_read(padapter, 0, mapLen, pEfuseHal->BTEfuseInitMap) == _FAIL)
		{
			DBG_871X("%s: rtw_BT_efuse_map_read Fail!!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		sprintf(extra, "\n");
		for (i=0; i<512; i+=16)
		{
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
			sprintf(extra,"%s\t",extra);
			for (; j<16; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
			sprintf(extra, "%s\n", extra);
		}
	}
	else if (strcmp(tmp[0],"btbmap") == 0)
	{
		BTEfuse_PowerSwitch(padapter,1,_TRUE);
		
		mapLen = EFUSE_BT_MAX_MAP_LEN;
		if (rtw_BT_efuse_map_read(padapter, 0, mapLen, pEfuseHal->BTEfuseInitMap) == _FAIL)
		{
			DBG_871X("%s: rtw_BT_efuse_map_read Fail!!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		sprintf(extra, "\n");
		for (i=512; i<1024 ; i+=16)
		{
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++)
			{
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
			sprintf(extra,"%s\t",extra);
			for (; j<16; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->BTEfuseInitMap[i+j]);
			}
			sprintf(extra, "%s\n", extra);
		}
	}
	else if (strcmp(tmp[0],"btrmap") == 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
		{
			err = -EINVAL;
			goto exit;
		}

