jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
		BTEfuse_PowerSwitch(padapter,1,_TRUE);
		
		addr = simple_strtoul(tmp[1], &ptmp, 16);
		DBG_871X("%s: addr=0x%X\n", __FUNCTION__, addr);

		cnts = simple_strtoul(tmp[2], &ptmp, 10);
		if (cnts == 0)
		{
			DBG_871X("%s: btrmap Fail!! cnts error!\n", __FUNCTION__);
			err = -EINVAL;
			goto exit;
		}
		DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);

		EFUSE_GetEfuseDefinition(padapter, EFUSE_BT, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
		if ((addr + cnts) > max_available_size)
		{
			DBG_871X("%s: addr(0x%X)+cnts(%d) parameter error!\n", __FUNCTION__, addr, cnts);
			err = -EFAULT;
			goto exit;
		}

		if (rtw_BT_efuse_map_read(padapter, addr, cnts, data) == _FAIL) 
		{
			DBG_871X("%s: rtw_BT_efuse_map_read error!!\n", __FUNCTION__);
			err = -EFAULT;
			goto exit;
		}

		*extra = 0;
		for (i=0; i<cnts; i++)
		{
			sprintf(extra, "%s 0x%02X ", extra, data[i]);
		}
		DBG_871X(FUNC_ADPT_FMT ": BT MAC=[%s]\n", FUNC_ADPT_ARG(padapter), extra);
	}
	else if (strcmp(tmp[0], "btffake") == 0)
	{
		sprintf(extra, "\n");
		for (i=0; i<512; i+=16)
		{
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
			sprintf(extra, "%s\n", extra);
		}
	}
	else if (strcmp(tmp[0],"btbfake") == 0)
	{
		sprintf(extra, "\n");
		for (i=512; i<1024; i+=16)
		{
			sprintf(extra, "%s0x%03x\t", extra, i);
			for (j=0; j<8; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[i+j]);
			}
			sprintf(extra, "%s\n", extra);
		}
	}
	else if (strcmp(tmp[0],"wlrfkmap")== 0)
	{
		sprintf(extra, "\n");
		for (i=0; i<EFUSE_MAP_SIZE; i+=16)
		{
			sprintf(extra, "%s0x%02x\t", extra, i);
			for (j=0; j<8; j++) {
				sprintf(extra, "%s%02X ", extra, pEfuseHal->fakeEfuseModifiedMap[i+j]);
			}
			sprintf(extra, "%s\t", extra);
			for (; j<16; j++) {
				sprintf(extra, "%s %02X", extra, pEfuseHal->fakeEfuseModifiedMap[i+j]);
			}
			sprintf(extra, "%s\n", extra);
		}

	}
	else if (strcmp(tmp[0],"wlrfkrmap")== 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
				{
					DBG_871X("%s: rmap Fail!! Parameters error!\n", __FUNCTION__);
					err = -EINVAL;
					goto exit;
				}
				addr = simple_strtoul(tmp[1], &ptmp, 16);
				DBG_871X("%s: addr=%x\n", __FUNCTION__, addr);
		
				cnts = simple_strtoul(tmp[2], &ptmp, 10);
				if (cnts == 0)
				{
					DBG_871X("%s: rmap Fail!! cnts error!\n", __FUNCTION__);
					err = -EINVAL;
					goto exit;
				}
				DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
		
			*extra = 0;
			for (i=0; i<cnts; i++) {
					DBG_871X("wlrfkrmap = 0x%02x \n", pEfuseHal->fakeEfuseModifiedMap[addr+i]);
					sprintf(extra, "%s0x%02X ", extra, pEfuseHal->fakeEfuseModifiedMap[addr+i]);
			}
	}
	else if (strcmp(tmp[0],"btrfkrmap")== 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
				{
					DBG_871X("%s: rmap Fail!! Parameters error!\n", __FUNCTION__);
					err = -EINVAL;
					goto exit;
				}
				addr = simple_strtoul(tmp[1], &ptmp, 16);
				DBG_871X("%s: addr=%x\n", __FUNCTION__, addr);
		
				cnts = simple_strtoul(tmp[2], &ptmp, 10);
				if (cnts == 0)
				{
					DBG_871X("%s: rmap Fail!! cnts error!\n", __FUNCTION__);
					err = -EINVAL;
					goto exit;
				}
				DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
		
			*extra = 0;
			for (i=0; i<cnts; i++) {
					DBG_871X("wlrfkrmap = 0x%02x \n", pEfuseHal->fakeBTEfuseModifiedMap[addr+i]);
					sprintf(extra, "%s0x%02X ", extra, pEfuseHal->fakeBTEfuseModifiedMap[addr+i]);
			}
	}
	else
	{
		 sprintf(extra, "Command not found!");
	}

exit:
	if (data)
		rtw_mfree(data, EFUSE_BT_MAX_MAP_LEN);
	if (rawdata)
		rtw_mfree(rawdata, EFUSE_BT_MAX_MAP_LEN);
	if (!err)
		wrqu->length = strlen(extra);
	
	if (padapter->registrypriv.mp_mode == 0)
	{
	#ifdef CONFIG_IPS		
	rtw_pm_set_ips(padapter, ips_mode);
#endif

	#ifdef CONFIG_LPS	
	rtw_pm_set_lps(padapter, lps_mode);
#endif
	}

	#ifdef CONFIG_IOL
	padapter->registrypriv.fw_iol = org_fw_iol;// 0:Disable, 1:enable, 2:by usb speed
	#endif
	return err;
}

static int rtw_mp_efuse_set(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu;
	PADAPTER padapter;
	struct pwrctrl_priv *pwrctrlpriv ;
	PHAL_DATA_TYPE pHalData;
	PEFUSE_HAL pEfuseHal;

	u8 ips_mode = IPS_NUM;
	u8 lps_mode = PS_MODE_NUM;
	u32 i=0,j=0, jj, kk;
	u8 *setdata = NULL;
	u8 *ShadowMapBT = NULL;
	u8 *ShadowMapWiFi = NULL;
	u8 *setrawdata = NULL;
	char *pch, *ptmp, *token, *tmp[3]={0x00,0x00,0x00};
	u16 addr=0, cnts=0, BTStatus=0 , max_available_size=0;
	int err;

	wrqu = (struct iw_point*)wdata;
	padapter = rtw_netdev_priv(dev);
	pwrctrlpriv = adapter_to_pwrctl(padapter);
	pHalData = GET_HAL_DATA(padapter);
	pEfuseHal = &pHalData->EfuseHal;
	err = 0;
	
	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
			return -EFAULT;
			
	setdata = rtw_zmalloc(1024);
	if (setdata == NULL)
	{
		err = -ENOMEM;
		goto exit;
	}
	ShadowMapBT = rtw_malloc(EFUSE_BT_MAX_MAP_LEN);
	if (ShadowMapBT == NULL)
	{
		err = -ENOMEM;
		goto exit;
	}
	ShadowMapWiFi = rtw_malloc(EFUSE_MAP_SIZE);
	if (ShadowMapWiFi == NULL)
	{
		err = -ENOMEM;
		goto exit;
	}
	setrawdata = rtw_malloc(EFUSE_MAX_SIZE);
	if (setrawdata == NULL)
	{
		err = -ENOMEM;
		goto exit;
	}

	#ifdef CONFIG_LPS
	lps_mode = pwrctrlpriv->power_mgnt;//keep org value
	rtw_pm_set_lps(padapter,PS_MODE_ACTIVE);
	#endif	
	
	#ifdef CONFIG_IPS	
	ips_mode = pwrctrlpriv->ips_mode;//keep org value
	rtw_pm_set_ips(padapter,IPS_NONE);
	#endif	
			
	pch = extra;
	DBG_871X("%s: in=%s\n", __FUNCTION__, extra);
	
	i = 0;
	while ((token = strsep(&pch, ",")) != NULL)
	{
		if (i > 2) break;
		tmp[i] = token;
		i++;
	}

	if (strcmp(tmp[0], "wmap") == 0)
	{
		if ((tmp[1]==NULL) || (tmp[2]==NULL))
		{
			err = -EINVAL;
			goto exit;
		}

#if 1
		addr=0x1ff;
		rtw_write8(padapter, EFUSE_CTRL+1, (addr & 0xff));
		rtw_msleep_os(10);
		rtw_write8(padapter, EFUSE_CTRL+2, ((addr >> 8) & 0x03));
		rtw_msleep_os(10);
		rtw_write8(padapter, EFUSE_CTRL+3, 0x72);
		rtw_msleep_os(10);
		rtw_read8(padapter, EFUSE_CTRL);
#endif

		addr = simple_strtoul(tmp[1], &ptmp, 16);
		addr &= 0xFFF;

		cnts = strlen(tmp[2]);
		if (cnts%2)
		{
			err = -EINVAL;
			goto exit;
		}
		cnts /= 2;
		if (cnts == 0)
		{
			err = -EINVAL;
			goto exit;
		}

		DBG_871X("%s: addr=0x%X\n", __FUNCTION__, addr);
		DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
		DBG_871X("%s: map data=%s\n", __FUNCTION__, tmp[2]);
				
