jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
		for (jj=0, kk=0; jj<cnts; jj++, kk+=2)
		{
			pEfuseHal->fakeEfuseModifiedMap[addr+jj] = key_2char2num(tmp[2][kk], tmp[2][kk+1]);
		}
	}

exit:
	if (setdata)
		rtw_mfree(setdata, 1024);
	if (ShadowMapBT)
		rtw_mfree(ShadowMapBT, EFUSE_BT_MAX_MAP_LEN);
	if (ShadowMapWiFi)
		rtw_mfree(ShadowMapWiFi, EFUSE_MAP_SIZE);
	if (setrawdata)
		rtw_mfree(setrawdata, EFUSE_MAX_SIZE);
	
	wrqu->length = strlen(extra);

	if (padapter->registrypriv.mp_mode == 0)
	{
	#ifdef CONFIG_IPS		
	rtw_pm_set_ips(padapter, ips_mode);
        #endif

	#ifdef CONFIG_LPS	
	rtw_pm_set_lps(padapter, lps_mode);
        #endif
	}

	return err;
}

#if defined(CONFIG_MP_INCLUDED) && defined(CONFIG_MP_IWPRIV_SUPPORT)
/*
 * Input Format: %s,%d,%d
 *	%s is width, could be
 *		"b" for 1 byte
 *		"w" for WORD (2 bytes)
 *		"dw" for DWORD (4 bytes)
 *	1st %d is address(offset)
 *	2st %d is data to write
 */
static int rtw_mp_write_reg(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	char *pch, *pnext, *ptmp;
	char *width_str;
	char width;
	u32 addr, data;
	int ret;
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
				 return -EFAULT;
				 
	_rtw_memset(extra, 0, wrqu->length);	
	  
	pch = input;

	pnext = strpbrk(pch, " ,.-");
	if (pnext == NULL) return -EINVAL;
	*pnext = 0;
	width_str = pch;

	pch = pnext + 1;
	pnext = strpbrk(pch, " ,.-");
	if (pnext == NULL) return -EINVAL;
	*pnext = 0;
	addr = simple_strtoul(pch, &ptmp, 16);
	if (addr > 0x3FFF) return -EINVAL;

	pch = pnext + 1;
	if ((pch - extra) >= wrqu->length) return -EINVAL;
	data = simple_strtoul(pch, &ptmp, 16);

	ret = 0;
	width = width_str[0];
	switch (width) {
		case 'b':
			if (data > 0xFF) {
				ret = -EINVAL;
				break;
			}
			rtw_write8(padapter, addr, data);
			break;
		case 'w':
			if (data > 0xFFFF) {
				ret = -EINVAL;
				break;
			}
			rtw_write16(padapter, addr, data);
			break;
		case 'd':
			rtw_write32(padapter, addr, data);
			break;
		default:
			ret = -EINVAL;
			break;
	}

	return ret;
}

/*
 * Input Format: %s,%d
 *	%s is width, could be
 *		"b" for 1 byte
 *		"w" for WORD (2 bytes)
 *		"dw" for DWORD (4 bytes)
 *	%d is address(offset)
 *
 * Return:
 *	%d for data readed
 */
static int rtw_mp_read_reg(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	char input[wrqu->length];
	char *pch, *pnext, *ptmp;
	char *width_str;
	char width;
	char data[20],tmp[20];
	u32 addr;
	u32 ret, i=0, j=0, strtout=0;
	PADAPTER padapter = rtw_netdev_priv(dev);


	if (wrqu->length > 128) 
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	_rtw_memset(data, 0, 20);
	_rtw_memset(tmp, 0, 20);
	_rtw_memset(extra, 0, wrqu->length);

	pch = input;
	pnext = strpbrk(pch, " ,.-");
	if (pnext == NULL) return -EINVAL;
	*pnext = 0;
	width_str = pch;

	pch = pnext + 1;
	if ((pch - input) >= wrqu->length) return -EINVAL;
	
	addr = simple_strtoul(pch, &ptmp, 16);
	if (addr > 0x3FFF) return -EINVAL;

	ret = 0;
	width = width_str[0];
	switch (width)
	{
		case 'b':
			sprintf(extra, "%d\n",  rtw_read8(padapter, addr));
			wrqu->length = strlen(extra);
			break;
		case 'w':
			sprintf(data, "%04x\n", rtw_read16(padapter, addr));
			for( i=0 ; i <= strlen(data) ; i++)
				{
					  if( i%2==0 )
					  {
						   tmp[j]=' ';
						   j++;
					  }
					  if ( data[i] != '\0' )
					 	 tmp[j] = data[i];
					 	
					  	 j++;
				}
				pch = tmp;		
				DBG_871X("pch=%s",pch);
				
				while( *pch != '\0' )
				{
					pnext = strpbrk(pch, " ");
					if (!pnext)
						break;
					
					pnext++;
					if ( *pnext != '\0' )
					{
						  strtout = simple_strtoul (pnext , &ptmp, 16);
						  sprintf( extra, "%s %d" ,extra ,strtout );
					}
					else{
						  break;
					}
					pch = pnext;
				}
			wrqu->length = 7;
			break;
		case 'd':
			sprintf(data, "%08x", rtw_read32(padapter, addr));
				for( i=0 ; i <= strlen(data) ; i++)
				{
					  if( i%2==0 )
					  {
						   tmp[j]=' ';
						   j++;
					  }
					  if ( data[i] != '\0' )
					  tmp[j] = data[i];
					  
					  j++;
				}
				pch = tmp;		
				DBG_871X("pch=%s",pch);
				
				while( *pch != '\0' )
				{
					pnext = strpbrk(pch, " ");
					if (!pnext)
						break;
					
					pnext++;
					if ( *pnext != '\0' )
					{
						  strtout = simple_strtoul (pnext , &ptmp, 16);
						  sprintf( extra, "%s %d" ,extra ,strtout );
					}
					else{
			break;
					}
					pch = pnext;
				}
			wrqu->length = strlen(extra);
			break;
			
		default:
			wrqu->length = 0;
			ret = -EINVAL;
			break;
			
	}

	return ret;
}

/*
 * Input Format: %d,%x,%x
 *	%d is RF path, should be smaller than MAX_RF_PATH_NUMS
 *	1st %x is address(offset)
 *	2st %x is data to write
 */
 static int rtw_mp_write_rf(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{			
/*static int rtw_mp_write_rf(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
*/
	u32 path, addr, data;
	int ret;
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			 return -EFAULT;


	ret = sscanf(input, "%d,%x,%x", &path, &addr, &data);
	if (ret < 3) return -EINVAL;

	if (path >= GET_HAL_RFPATH_NUM(padapter)) return -EINVAL;
	if (addr > 0xFF) return -EINVAL;
	if (data > 0xFFFFF) return -EINVAL;
	
	_rtw_memset(extra, 0, wrqu->length);
	
	write_rfreg(padapter, path, addr, data);
	
	sprintf(extra, "write_rf completed \n");
	wrqu->length = strlen(extra);
	
	return 0;
}

/*
 * Input Format: %d,%x
 *	%d is RF path, should be smaller than MAX_RF_PATH_NUMS
 *	%x is address(offset)
 *
 * Return:
 *	%d for data readed
 */
static int rtw_mp_read_rf(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	char input[wrqu->length];
	char *pch, *pnext, *ptmp;
	char data[20],tmp[20];
	u32 path, addr;
	u32 ret,i=0 ,j=0,strtou=0;
	PADAPTER padapter = rtw_netdev_priv(dev);


	if (wrqu->length > 128) return -EFAULT;
	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

