jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
	ret = sscanf(input, "%d,%x", &path, &addr);
	if (ret < 2) return -EINVAL;

	if (path >= GET_HAL_RFPATH_NUM(padapter)) return -EINVAL;
	if (addr > 0xFF) return -EINVAL;
	
	_rtw_memset(extra, 0, wrqu->length);
	
	sprintf(data, "%08x", read_rfreg(padapter, path, addr));
				for( i=0 ; i <= strlen(data) ; i++)
				{
					  if( i%2==0 )
					  {
						   tmp[j]=' ';
						   j++;
					  }
					  tmp[j] = data[i];
					  j++;
				}
				pch = tmp;		
				DBG_871X("pch=%s",pch);
				
				while( *pch != '\0' )
				{
					pnext = strpbrk(pch, " ");
					pnext++;
					if ( *pnext != '\0' )
					{
						  strtou = simple_strtoul (pnext , &ptmp, 16);
						  sprintf( extra, "%s %d" ,extra ,strtou );
					}
					else{
						  break;
					}
					pch = pnext;
				}
			wrqu->length = strlen(extra);	

	return 0;
}

static int rtw_mp_start(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 val8;
	PADAPTER padapter = rtw_netdev_priv(dev);
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	struct dm_priv	*pdmpriv = &pHalData->dmpriv;
	struct hal_ops *pHalFunc = &padapter->HalFunc;

	if(padapter->registrypriv.mp_mode ==0)
	{
		#if (defined(CONFIG_RTL8723A) || defined(CONFIG_RTL8723B))
		DBG_871X("_rtw_mp_xmit_priv for Download BT patch FW\n");
		_rtw_mp_xmit_priv(&padapter->xmitpriv);
		#endif
	
		padapter->registrypriv.mp_mode =1;

		rtw_pm_set_ips(padapter,IPS_NONE);
		LeaveAllPowerSaveMode(padapter);

		MPT_InitializeAdapter(padapter, 1);
#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_HaltNotify(padapter);
		rtw_btcoex_SetManualControl(padapter, _TRUE);
		pdmpriv->DMFlag &= ~DYNAMIC_FUNC_BT;
		padapter->registrypriv.mp_mode=0;
		pHalFunc->hal_init(padapter);
		padapter->registrypriv.mp_mode=1;
#endif
	}

	if (padapter->registrypriv.mp_mode == 0)
		return -EPERM;

	if (padapter->mppriv.mode == MP_OFF) {
		if (mp_start_test(padapter) == _FAIL)
			return -EPERM;
		padapter->mppriv.mode = MP_ON;
		MPT_PwrCtlDM(padapter,0);
	}
	padapter->mppriv.bmac_filter = _FALSE;
#ifdef CONFIG_RTL8723B
	rtw_write8(padapter, 0x66, 0x27);
	rtw_write8(padapter, 0xc50, 0x20);
#endif	
	ODM_Write_DIG(&pHalData->odmpriv,0x20);

	return 0;
}

static int rtw_mp_stop(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct hal_ops *pHalFunc = &padapter->HalFunc;

	if(padapter->registrypriv.mp_mode ==1)
	{
		#if (defined(CONFIG_RTL8723A) || defined(CONFIG_RTL8723B))
		DBG_871X("_rtw_mp_xmit_priv reinit for normal mode\n");
		_rtw_mp_xmit_priv(&padapter->xmitpriv);
		#endif
		
		MPT_DeInitAdapter(padapter);
		pHalFunc->hal_deinit(padapter);
		padapter->registrypriv.mp_mode=0;
		pHalFunc->hal_init(padapter);
	}
	
	if (padapter->mppriv.mode != MP_OFF) {
		mp_stop_test(padapter);
		padapter->mppriv.mode = MP_OFF;
	}

	return 0;
}

extern int wifirate2_ratetbl_inx(unsigned char rate);

static int rtw_mp_rate(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 rate = MPT_RATE_1M;
	u8 		input[wrqu->length];
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;
			
	rate = rtw_atoi(input);
	sprintf( extra, "Set data rate to %d" , rate );
		
	if(rate <= 0x7f)
		rate = wifirate2_ratetbl_inx( (u8)rate);	
	else if (rate < 0x90)
		rate =(rate - 0x80 + MPT_RATE_MCS0);
	else 
		rate =(rate - MPT_RATE_VHT1SS_MCS0); 

	
	if (rate >= MPT_RATE_LAST )	
	return -EINVAL;

	padapter->mppriv.rateidx = rate;
	Hal_SetDataRate(padapter);
	
	wrqu->length = strlen(extra) + 1;
	return 0;
}

static int rtw_mp_channel(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{

	PADAPTER padapter = rtw_netdev_priv(dev);
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(padapter);
	u8 		input[wrqu->length];
	u32 	channel = 1;
	int cur_ch_offset;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;
	
	channel = rtw_atoi(input);
	sprintf( extra, "Change channel %d to channel %d", padapter->mppriv.channel , channel );
	padapter->mppriv.channel = channel;
	pHalData->CurrentChannel = channel;
	Hal_SetChannel(padapter);

	wrqu->length = strlen(extra) + 1;
	return 0;
}

static int rtw_mp_bandwidth(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 bandwidth=0, sg=0;
	int cur_ch_offset;
	PADAPTER padapter = rtw_netdev_priv(dev);
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(padapter);
                
	
	sscanf(extra, "40M=%d,shortGI=%d", &bandwidth, &sg);
	
	if (bandwidth == 1)
		bandwidth=CHANNEL_WIDTH_40;
	else if (bandwidth == 2)
		bandwidth=CHANNEL_WIDTH_80;
	DBG_871X("%s: bw=%d sg=%d \n", __func__, bandwidth , sg);
	
	padapter->mppriv.bandwidth = (u8)bandwidth;
	pHalData->CurrentChannelBW = bandwidth;
	padapter->mppriv.preamble = sg;
	
	SetBandwidth(padapter);

	return 0;
}


static int rtw_mp_txpower_index(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];
	u32 rfpath;
	u32 txpower_inx;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	rfpath = rtw_atoi(input);
	txpower_inx = mpt_ProQueryCalTxPower(padapter, rfpath);
	sprintf(extra, " %d", txpower_inx);
	wrqu->length = strlen(extra) + 1;

	return 0;
}


static int rtw_mp_txpower(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32		idx_a=0,idx_b=0,MsetPower=1;
	u8 		input[wrqu->length];

	PADAPTER padapter = rtw_netdev_priv(dev);

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;

	MsetPower = strncmp(input, "off", 3); 
	sscanf(input,"patha=%d,pathb=%d",&idx_a,&idx_b);
	if(MsetPower==0)
	{
		padapter->mppriv.bSetTxPower = 0;
		sprintf( extra, "MP Set power off");
	}
	else
	{
	sprintf( extra, "Set power level path_A:%d path_B:%d", idx_a , idx_b );
	padapter->mppriv.txpoweridx = (u8)idx_a;
	padapter->mppriv.txpoweridx_b = (u8)idx_b;
	padapter->mppriv.bSetTxPower = 1;
		Hal_SetAntennaPathPower(padapter);
	}
	wrqu->length = strlen(extra) + 1;
	return 0;
}

static int rtw_mp_ant_tx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 i;
	u8 		input[wrqu->length];
	u16 antenna = 0;
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;
			
	
	sprintf( extra, "switch Tx antenna to %s", input );
	
	for (i=0; i < strlen(input); i++)
	{
		switch(input[i])
			{
				case 'a' :
								antenna|=ANTENNA_A;
								break;
				case 'b':
								antenna|=ANTENNA_B;
								break;
			}
	}
	padapter->mppriv.antenna_tx = antenna;
	
	Hal_SetAntenna(padapter);

