jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
	wrqu->length = strlen(extra) + 1;
	return 0;
}

static int rtw_mp_ant_rx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 i;
	u16 antenna = 0;
	u8 		input[wrqu->length];
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;
	_rtw_memset(extra, 0, wrqu->length);
	
	sprintf( extra, "switch Rx antenna to %s", input );
	
	for (i=0; i < strlen(input); i++) {
	switch( input[i] )
			{
				case 'a' :
								antenna|=ANTENNA_A;
								break;
				case 'b':
								antenna|=ANTENNA_B;
								break;
				case 'c' :
								antenna|=ANTENNA_C;
								break;
			}
	}
	
	padapter->mppriv.antenna_rx = antenna;
	Hal_SetAntenna(padapter);
	wrqu->length = strlen(extra);
	
	return 0;
}

static int rtw_mp_ctx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 pkTx = 1, countPkTx = 1, cotuTx = 1, CarrSprTx = 1, scTx = 1, sgleTx = 1, stop = 1;
	u32 bStartTest = 1;
	u32 count = 0,pktinterval=0;
	struct mp_priv *pmp_priv;
	struct pkt_attrib *pattrib;

	PADAPTER padapter = rtw_netdev_priv(dev);


	pmp_priv = &padapter->mppriv;

	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
			return -EFAULT;
			
	DBG_871X("%s: in=%s\n", __func__, extra);

	countPkTx = strncmp(extra, "count=", 5);
	cotuTx = strncmp(extra, "background", 20);
	CarrSprTx = strncmp(extra, "background,cs", 20);
	scTx = strncmp(extra, "background,sc", 20);
	sgleTx = strncmp(extra, "background,stone", 20);
	pkTx = strncmp(extra, "background,pkt", 20);
	stop = strncmp(extra, "stop", 4);
	sscanf(extra, "count=%d,pkt", &count);
	sscanf(extra, "pktinterval=%d", &pktinterval);
	
	_rtw_memset(extra, '\0', sizeof(extra));

	if( pktinterval !=0 )
	{
		sprintf( extra, "Pkt Interval = %d",pktinterval);
		padapter->mppriv.pktInterval = pktinterval;
		
		wrqu->length = strlen(extra);
		return 0;
	}
	
	if (stop == 0) {
		bStartTest = 0;
		pmp_priv->tx.stop = 1;
		sprintf( extra, "Stop continuous Tx");
	} else {
		bStartTest = 1;
		if (pmp_priv->mode != MP_ON) {
			if (pmp_priv->tx.stop != 1) {
				DBG_871X("%s: MP_MODE != ON %d\n", __func__, pmp_priv->mode);
				return  -EFAULT;
			}
		}
	}

	if (pkTx == 0 || countPkTx == 0)
		pmp_priv->mode = MP_PACKET_TX;
	if (sgleTx == 0)
		pmp_priv->mode = MP_SINGLE_TONE_TX;
	if (cotuTx == 0)
		pmp_priv->mode = MP_CONTINUOUS_TX;
	if (CarrSprTx == 0)
		pmp_priv->mode = MP_CARRIER_SUPPRISSION_TX;
	if (scTx == 0)
		pmp_priv->mode = MP_SINGLE_CARRIER_TX;

	switch (pmp_priv->mode)
	{
		case MP_PACKET_TX:
		
			if (bStartTest == 0)
			{
				pmp_priv->tx.stop = 1;
				pmp_priv->mode = MP_ON;
				sprintf( extra, "Stop continuous Tx");
			}
			else if (pmp_priv->tx.stop == 1)
			{
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 count=%u,\n",count);
				pmp_priv->tx.stop = 0;
				pmp_priv->tx.count = count;
				pmp_priv->tx.payload = 2;
#ifdef CONFIG_80211N_HT
				pmp_priv->tx.attrib.ht_en = 1;
#endif
#ifdef CONFIG_80211AC_VHT
				pmp_priv->tx.attrib.raid = RATEID_IDX_VHT_1SS;
#endif
				pattrib = &pmp_priv->tx.attrib;
				pattrib->pktlen = 1000;
				_rtw_memset(pattrib->dst, 0xFF, ETH_ALEN);
				SetPacketTx(padapter);
			} 
			else {
				return -EFAULT;
			}
				wrqu->length = strlen(extra);
				return 0;

		case MP_SINGLE_TONE_TX:
			if (bStartTest != 0){
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
            }
			Hal_SetSingleToneTx(padapter, (u8)bStartTest);
			break;

		case MP_CONTINUOUS_TX:
			if (bStartTest != 0){
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
           		 }
           	Hal_SetContinuousTx(padapter, (u8)bStartTest);
			break;

		case MP_CARRIER_SUPPRISSION_TX:
			if (bStartTest != 0){
				if( pmp_priv->rateidx <= MPT_RATE_11M ) 
				{
					sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
					
				}else
					sprintf( extra, "Specify carrier suppression but not CCK rate");
			}
			Hal_SetCarrierSuppressionTx(padapter, (u8)bStartTest);
			break;

		case MP_SINGLE_CARRIER_TX:
			if (bStartTest != 0){
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
			}
			Hal_SetSingleCarrierTx(padapter, (u8)bStartTest);
			break;

		default:
			sprintf( extra, "Error! Continuous-Tx is not on-going.");
			return -EFAULT;
	}

	if ( bStartTest==1 && pmp_priv->mode != MP_ON) {
		struct mp_priv *pmp_priv = &padapter->mppriv;
		if (pmp_priv->tx.stop == 0) {
			pmp_priv->tx.stop = 1;
			rtw_msleep_os(5);
		}
#ifdef CONFIG_80211N_HT
		pmp_priv->tx.attrib.ht_en = 1;
#endif
#ifdef CONFIG_80211AC_VHT
		pmp_priv->tx.attrib.raid = RATEID_IDX_VHT_1SS;
#endif
		pmp_priv->tx.stop = 0;
		pmp_priv->tx.count = 1;
		SetPacketTx(padapter);
	} else {
		pmp_priv->mode = MP_ON;
	}

	wrqu->length = strlen(extra);
	return 0;
}


static int rtw_mp_disable_bt_coexist(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = (PADAPTER)rtw_netdev_priv(dev);
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	struct dm_priv	*pdmpriv = &pHalData->dmpriv;
	struct hal_ops *pHalFunc = &padapter->HalFunc;
	
	u8 input[wrqu->data.length];
	u32 bt_coexist;

	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length))
		return -EFAULT;
	
	bt_coexist = rtw_atoi(input);
	
	if( bt_coexist == 0 )
	{
		RT_TRACE(_module_mp_, _drv_info_,
			("Set OID_RT_SET_DISABLE_BT_COEXIST: disable BT_COEXIST\n"));
		DBG_871X("Set OID_RT_SET_DISABLE_BT_COEXIST: disable BT_COEXIST\n");
#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_HaltNotify(padapter);
		rtw_btcoex_SetManualControl(padapter, _TRUE);
		pdmpriv->DMFlag &= ~DYNAMIC_FUNC_BT;
		rtw_write16(padapter, 0x870, 0x300);
		rtw_write16(padapter, 0x860, 0x110); 
#endif
	}
	else
	{
		RT_TRACE(_module_mp_, _drv_info_,
			("Set OID_RT_SET_DISABLE_BT_COEXIST: enable BT_COEXIST\n"));
#ifdef CONFIG_BT_COEXIST		
		pdmpriv->DMFlag |= DYNAMIC_FUNC_BT;
		rtw_btcoex_SetManualControl(padapter, _FALSE);
#endif
	}

