jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
	return 0;	
}


static int rtw_mp_arx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 bStartRx=0,bStopRx=0,bQueryPhy=0,bQueryMac=0,bSetBssid=0;
	u8 bmac_filter = 0,bfilter_init=0;
	u32 cckok=0,cckcrc=0,ofdmok=0,ofdmcrc=0,htok=0,htcrc=0,OFDM_FA=0,CCK_FA=0,DropPacket=0,vht_ok=0,vht_err=0;
	u32		mac_cck_ok=0, mac_ofdm_ok=0, mac_ht_ok=0, mac_vht_ok=0;
	u32		mac_cck_err=0, mac_ofdm_err=0, mac_ht_err=0, mac_vht_err=0;
	u8 		input[wrqu->length];
	char *pch, *ptmp, *token, *tmp[2]={0x00,0x00};
	u32 i=0,ii=0,jj=0,kk=0,cnts=0;
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct mp_priv *pmppriv = &padapter->mppriv;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;

	DBG_871X("%s: %s\n", __func__, input);

	bStartRx = (strncmp(input, "start", 5)==0)?1:0;
	bStopRx = (strncmp(input, "stop", 5)==0)?1:0;
	bQueryPhy = (strncmp(input, "phy", 3)==0)?1:0;
	bQueryMac = (strncmp(input, "mac", 3)==0)?1:0;
	bSetBssid = (strncmp(input, "setbssid=", 8)==0)?1:0;
	bmac_filter = (strncmp(input, "accept_mac",10)==0)?1:0;


	if(bSetBssid==1){
		pch = input;
		while ((token = strsep(&pch, "=")) != NULL)
		{
			if (i > 1) break;
			tmp[i] = token;
			i++;
		}
		if ((tmp[0]==NULL) && (tmp[1]==NULL)){
			return -EFAULT;
		}
		else{
			cnts = strlen(tmp[1])/2;
			if (cnts<1) return -EFAULT;
			DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
			DBG_871X("%s: data=%s\n", __FUNCTION__, tmp[1]);
			for (jj=0, kk=0; jj < cnts ; jj++, kk+=2){
					 pmppriv->network_macaddr[jj] = key_2char2num(tmp[1][kk], tmp[1][kk+1]);
					DBG_871X("network_macaddr[%d]=%x \n",jj, pmppriv->network_macaddr[jj]);
			}
		}
		pmppriv->bSetRxBssid = _TRUE;
	}

	if(bmac_filter)
	{
		pmppriv->bmac_filter = bmac_filter;
		pch = input;
		while ((token = strsep(&pch, "=")) != NULL)
		{
			if (i > 1) break;
			tmp[i] = token;
			i++;
		}
		if ((tmp[0]==NULL) && (tmp[1]==NULL)){
			return -EFAULT;
		}
		else{
			cnts = strlen(tmp[1])/2;
			if (cnts<1) return -EFAULT;
			DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
			DBG_871X("%s: data=%s\n", __FUNCTION__, tmp[1]);
			for (jj=0, kk=0; jj < cnts ; jj++, kk+=2){
					pmppriv->mac_filter[jj] = key_2char2num(tmp[1][kk], tmp[1][kk+1]);
					DBG_871X("%s mac_filter[%d]=%x \n",__FUNCTION__,jj, pmppriv->mac_filter[jj]);
			}
		}
	}
	
	if(bStartRx)
	{
		sprintf( extra, "start");
		SetPacketRx(padapter, bStartRx);
	}
	else if(bStopRx)
	{
		SetPacketRx(padapter, 0);
		pmppriv->bmac_filter = _FALSE;
		sprintf( extra, "Received packet OK:%d CRC error:%d ,Filter out:%d",padapter->mppriv.rx_pktcount,padapter->mppriv.rx_crcerrpktcount,padapter->mppriv.rx_pktcount_filter_out);
	}
	else if(bQueryPhy)
	{          

		#ifdef CONFIG_RTL8188A
		{
		    	cckok      = PHY_QueryBBReg(padapter, 0xF04, 0x3FFF);	    
		    	ofdmok     = PHY_QueryBBReg(padapter, 0xF14, 0x3FFF);	    
		    	htok       = PHY_QueryBBReg(padapter, 0xF10, 0x3FFF);    
		    	vht_ok      = PHY_QueryBBReg(padapter, 0xF0C, 0x3FFF);    
		                                                  
		    	cckcrc     = PHY_QueryBBReg(padapter, 0xF04, 0x3FFF0000);
		    	ofdmcrc    = PHY_QueryBBReg(padapter, 0xF14, 0x3FFF0000);
		    	htcrc      = PHY_QueryBBReg(padapter, 0xF10, 0x3FFF0000);
		    	vht_err     = PHY_QueryBBReg(padapter, 0xF0C, 0x3FFF0000);
		} 
		#else
		{
		    	cckok      = PHY_QueryBBReg(padapter, 0xF88, bMaskDWord);		
		    	ofdmok     = PHY_QueryBBReg(padapter, 0xF94, bMaskLWord);		
			htok       = PHY_QueryBBReg(padapter, 0xF90, bMaskLWord);
	        	vht_ok      = 0;
		    
		    	cckcrc     = PHY_QueryBBReg(padapter, 0xF84, bMaskDWord);						
		    	ofdmcrc    = PHY_QueryBBReg(padapter, 0xF94, bMaskHWord);
		    	htcrc      = PHY_QueryBBReg(padapter, 0xF90, bMaskHWord);		
	        	vht_err     = 0;
		}
		#endif
 		CCK_FA=(rtw_read8(padapter, 0xa5b )<<8 ) | (rtw_read8(padapter, 0xa5c));
		sprintf( extra, "Phy Received packet OK:%d CRC error:%d FA Counter: %d",cckok+ofdmok+htok+vht_ok,cckcrc+ofdmcrc+htcrc+vht_err,OFDM_FA+CCK_FA);
	}
	else if(bQueryMac)
	{
		{
			PHY_SetMacReg(padapter, 0x664, BIT28|BIT29|BIT30|BIT31, 0x3);
		    	mac_cck_ok      = PHY_QueryMacReg(padapter, 0x664, bMaskLWord);	    
			PHY_SetMacReg(padapter, 0x664, BIT28|BIT29|BIT30|BIT31, 0x0);
			mac_ofdm_ok     = PHY_QueryMacReg(padapter, 0x664, bMaskLWord);	    
			PHY_SetMacReg(padapter, 0x664, BIT28|BIT29|BIT30|BIT31, 0x6);
			mac_ht_ok       = PHY_QueryMacReg(padapter, 0x664, bMaskLWord);    
		    	mac_vht_ok      = 0;
			
			PHY_SetMacReg(padapter, 0x664, BIT28|BIT29|BIT30|BIT31, 0x4);
		    	mac_cck_err     = PHY_QueryMacReg(padapter, 0x664, bMaskLWord);
		    	PHY_SetMacReg(padapter, 0x664, BIT28|BIT29|BIT30|BIT31, 0x1);
		    	mac_ofdm_err    = PHY_QueryMacReg(padapter, 0x664, bMaskLWord);
		    	PHY_SetMacReg(padapter, 0x664, BIT28|BIT29|BIT30|BIT31, 0x7);
		    	mac_ht_err      = PHY_QueryMacReg(padapter, 0x664, bMaskLWord);
		    	mac_vht_err     = 0;
			rtw_write32(padapter, 0x664, (rtw_read32(padapter, 0x0664)& 0x0FFFFFFF)| Mac_DropPacket);
			DropPacket = rtw_read32(padapter, 0x664)& 0x0000FFFF;
		} 
		
		sprintf( extra, "Mac Received packet OK: %d , CRC error: %d , FA Counter: %d , Drop Packets: %d\n",
				mac_cck_ok+mac_ofdm_ok+mac_ht_ok+mac_vht_ok,mac_cck_err+mac_ofdm_err+mac_ht_err+mac_vht_err,OFDM_FA+CCK_FA,DropPacket);			
	}
	wrqu->length = strlen(extra) + 1;

	
	return 0;
}

static int rtw_mp_trx_query(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 txok,txfail,rxok,rxfail,rxfilterout;
	PADAPTER padapter = rtw_netdev_priv(dev);

	txok=padapter->mppriv.tx.sended;
	txfail=0;
	rxok = padapter->mppriv.rx_pktcount;
	rxfail = padapter->mppriv.rx_crcerrpktcount;
	rxfilterout = padapter->mppriv.rx_pktcount_filter_out;

	_rtw_memset(extra, '\0', 128);

	sprintf(extra, "Tx OK:%d, Tx Fail:%d, Rx OK:%d, CRC error:%d ,Rx Filter out:%d \n", txok, txfail,rxok,rxfail,rxfilterout);

	wrqu->length=strlen(extra)+1;

	return 0;
}

static int rtw_mp_pwrtrk(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 enable;
	u32 thermal;
	s32 ret;
	PADAPTER padapter = rtw_netdev_priv(dev);
	HAL_DATA_TYPE			*pHalData = GET_HAL_DATA(padapter);
	u8 		input[wrqu->length];

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;

	_rtw_memset(extra, 0, wrqu->length);

	enable = 1;
	if (wrqu->length > 1) {
		if (strncmp(input, "stop", 4) == 0)
		{	
			enable = 0;
			sprintf(extra, "mp tx power tracking stop");
			pHalData->TxPowerTrackControl = _FALSE;
		}
		else if (sscanf(input, "ther=%d", &thermal)) {
			pHalData->TxPowerTrackControl = _TRUE;
				ret = Hal_SetThermalMeter(padapter, (u8)thermal);
				if (ret == _FAIL) return -EPERM;
				sprintf(extra, "mp tx power tracking start,target value=%d ok ",thermal);
		}else	{
				return -EINVAL;
		}
	}

	ret = Hal_SetPowerTracking(padapter, enable);
	if (ret == _FAIL) return -EPERM;

