jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
	wrqu->length = strlen(extra);

	return 0;
}

static int rtw_mp_psd(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	u8		input[wrqu->length];
	
	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;
	
	strcpy(extra,input);
	
	wrqu->length = mp_query_psd(padapter, extra);
	
	return 0;
}

static int rtw_mp_thermal(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 val;
	u16 bwrite=1;
	
	#ifdef CONFIG_RTL8192C
			u16 addr=EEPROM_THERMAL_METER_92C;
	#endif
	#ifdef CONFIG_RTL8192D
			u16 addr=EEPROM_THERMAL_METER_92D;
	#endif
	#ifdef CONFIG_RTL8723A
			u16 addr=EEPROM_THERMAL_METER_8723A;
	#endif
	#ifdef CONFIG_RTL8188E
			u16 addr=EEPROM_THERMAL_METER_88E;
	#endif
	#if defined(CONFIG_RTL8812A) || defined(CONFIG_RTL8821A)
			u16 addr=EEPROM_THERMAL_METER_8812;
	#endif
	#ifdef CONFIG_RTL8192E
			u16 addr=EEPROM_THERMAL_METER_8192E;
	#endif
	#ifdef CONFIG_RTL8723B
			u16 addr=EEPROM_THERMAL_METER_8723B;
	#endif
	u16 cnt=1;
	u16 max_available_size=0;
	PADAPTER padapter = rtw_netdev_priv(dev);	

	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
		return -EFAULT;

	 
	 bwrite = strncmp(extra, "write", 6);
	 
	 Hal_GetThermalMeter(padapter, &val);
	 
	 if( bwrite == 0 )	
	 {
			EFUSE_GetEfuseDefinition(padapter, EFUSE_WIFI, TYPE_AVAILABLE_EFUSE_BYTES_TOTAL, (PVOID)&max_available_size, _FALSE);
			if( 2 > max_available_size )
			{			
				DBG_871X("no available efuse!\n");
				return -EFAULT;
			}	
			if ( rtw_efuse_map_write(padapter, addr, cnt, &val) == _FAIL )
			{
				DBG_871X("rtw_efuse_map_write error \n");			
				return -EFAULT;
			} 
			else
			{
				 sprintf(extra, " efuse write ok :%d", val);	
			}
	  }
	  else
	  {
			 sprintf(extra, "%d", val);
	  }
	wrqu->length = strlen(extra);
	
	return 0;
}

static int rtw_mp_reset_stats(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	struct mp_priv *pmp_priv;
	struct pkt_attrib *pattrib;
	PADAPTER padapter = rtw_netdev_priv(dev);
	
	pmp_priv = &padapter->mppriv;
	
	pmp_priv->tx.sended = 0;
	pmp_priv->tx_pktcount = 0;
	pmp_priv->rx_pktcount = 0;
	pmp_priv->rx_pktcount_filter_out=0;
	pmp_priv->rx_crcerrpktcount = 0;

	if (IS_HARDWARE_TYPE_JAGUAR(padapter))
	{
		write_bbreg(padapter, 0xB58, BIT0, 0x1);
		write_bbreg(padapter, 0xB58, BIT0, 0x0);
	}
	else
	{
		write_bbreg(padapter, 0xF14, BIT16, 0x1);
		rtw_msleep_os(10);
		write_bbreg(padapter, 0xF14, BIT16, 0x0);
	}
	PHY_SetMacReg(padapter, 0x664, BIT27, 0x1); 
	PHY_SetMacReg(padapter, 0x664, BIT27, 0x0);
	return 0;
}

static int rtw_mp_dump(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	struct mp_priv *pmp_priv;
	struct pkt_attrib *pattrib;
        u32 value;
    u8		input[wrqu->length];
	u8 rf_type,path_nums = 0;
	u32 i,j=1,path;
	PADAPTER padapter = rtw_netdev_priv(dev);
	
	pmp_priv = &padapter->mppriv;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;
	
	if ( strncmp(input, "all", 4)==0 )
	{
		mac_reg_dump(RTW_DBGDUMP, padapter);
		bb_reg_dump(RTW_DBGDUMP, padapter);
		rf_reg_dump(RTW_DBGDUMP, padapter);
	}
	return 0;
}

static int rtw_mp_phypara(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{

	PADAPTER padapter = rtw_netdev_priv(dev);
	HAL_DATA_TYPE	*pHalData	= GET_HAL_DATA(padapter);
	char 	input[wrqu->length];
	u32		valxcap;
	
	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;
	
	DBG_871X("%s:iwpriv in=%s\n", __func__, input);
	
	sscanf(input, "xcap=%d", &valxcap);

	pHalData->CrystalCap = (u8)valxcap;
	Hal_ProSetCrystalCap( padapter , valxcap );

	sprintf( extra, "Set xcap=%d",valxcap );
	wrqu->length = strlen(extra) + 1;
	
return 0;

}

static int rtw_mp_SetRFPath(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char 	input[wrqu->data.length];
	s32		bMain=1,bTurnoff=1;
	
	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	DBG_871X("%s:iwpriv in=%s\n", __func__, input);	
	
	bMain = strncmp(input, "1", 2);
	bTurnoff = strncmp(input, "0", 3);

	if(bMain==0)
	{
		MP_PHY_SetRFPathSwitch(padapter,_TRUE);
		DBG_871X("%s:PHY_SetRFPathSwitch=TRUE\n", __func__);	
	}
	else if(bTurnoff==0)
	{
		MP_PHY_SetRFPathSwitch(padapter,_FALSE);
		DBG_871X("%s:PHY_SetRFPathSwitch=FALSE\n", __func__);	
	}
	
	return 0;
}

static int rtw_mp_QueryDrv(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char	input[wrqu->data.length];
	s32	qAutoLoad=1;

	EEPROM_EFUSE_PRIV *pEEPROM = GET_EEPROM_EFUSE_PRIV(padapter);
	
	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	DBG_871X("%s:iwpriv in=%s\n", __func__, input); 
	
	qAutoLoad = strncmp(input, "autoload", 8);

	if(qAutoLoad==0)
	{
		DBG_871X("%s:qAutoLoad\n", __func__);
		
		if(pEEPROM->bautoload_fail_flag)
			sprintf(extra, "fail");
		else
	        sprintf(extra, "ok");      
	}
		wrqu->data.length = strlen(extra) + 1;
	return 0;
}

/* update Tx AGC offset */
static int rtw_mp_antBdiff(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{


	return 0;
}


static int rtw_mp_PwrCtlDM(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	u8		input[wrqu->length];
	u8		bstart=1;
	
	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;

	bstart = strncmp(input, "start", 5);
	if(bstart==0){
		sprintf(extra, "PwrCtlDM start \n");
		MPT_PwrCtlDM(padapter,1);
	}else{
		sprintf(extra, "PwrCtlDM stop \n");
		MPT_PwrCtlDM(padapter,0);
	}
	wrqu->length = strlen(extra);

	return 0;
}

#if (defined(CONFIG_RTL8723A) || defined(CONFIG_RTL8723B))
/* update Tx AGC offset */
static int rtw_mp_SetBT(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct hal_ops *pHalFunc = &padapter->HalFunc;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);
	
	BT_REQ_CMD	BtReq;
	PMPT_CONTEXT	pMptCtx=&(padapter->mppriv.MptCtx);
	PBT_RSP_CMD 	pBtRsp=(PBT_RSP_CMD)&pMptCtx->mptOutBuf[0];
	char	input[128];
	char *pch, *ptmp, *token, *tmp[2]={0x00,0x00};
	u8 setdata[100];
	u8 resetbt=0x00;
	u8 tempval,BTStatus;
	u8 H2cSetbtmac[6];
	u8 u1H2CBtMpOperParm[4]={0x01};
	u16 testmode=1,ready=1,trxparam=1,setgen=1,getgen=1,testctrl=1,testbt=1,readtherm=1,setbtmac=1;
	u32 i=0,ii=0,jj=0,kk=0,cnts=0,status=0;
	PRT_MP_FIRMWARE	pBTFirmware = NULL;
	
	if (copy_from_user(extra, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	if(strlen(extra)<1) return -EFAULT;
	
