jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
	DBG_871X("%s:iwpriv in=%s\n", __FUNCTION__, extra); 
	ready = strncmp(extra, "ready", 5); 
	testmode = strncmp(extra, "testmode", 8);
	trxparam = strncmp(extra, "trxparam", 8); 
	setgen = strncmp(extra, "setgen", 6);
	getgen = strncmp(extra, "getgen", 6); 
	testctrl = strncmp(extra, "testctrl", 8);
	testbt = strncmp(extra, "testbt", 6);
	readtherm = strncmp(extra, "readtherm", 9);
	setbtmac = strncmp(extra, "setbtmac", 8);

	if ( strncmp(extra, "dlbt", 4) == 0)
	{
		pHalData->LastHMEBoxNum=0;
		padapter->bBTFWReady = _FALSE;
		rtw_write8(padapter, 0xa3, 0x05);
		BTStatus=rtw_read8(padapter, 0xa0);
		DBG_871X("%s: btwmap before read 0xa0 BT Status =0x%x \n", __FUNCTION__,BTStatus);
		if (BTStatus != 0x04)
		{
			sprintf(extra, "BT Status not Active DLFW FAIL\n");
			goto exit;
		}

		tempval = rtw_read8(padapter, 0x6B);
		tempval |= BIT7;
		rtw_write8(padapter, 0x6B, tempval);

		rtw_usleep_os(100);
		tempval = rtw_read8(padapter, 0x6B);
		tempval &= ~BIT6;
		rtw_write8(padapter, 0x6B, tempval);
		rtw_usleep_os(100);
		MPT_PwrCtlDM(padapter,0);
		rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)| 0x00000004));
		rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)& 0xFFFFFFEF));
		rtw_msleep_os(600);
		rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)| 0x00000010));
		rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)& 0xFFFFFFFB));
		rtw_msleep_os(1200);		
		pBTFirmware = (PRT_MP_FIRMWARE)rtw_zmalloc(sizeof(RT_MP_FIRMWARE));
		if(pBTFirmware==NULL)
			goto exit;
		padapter->bBTFWReady = _FALSE;
		FirmwareDownloadBT(padapter, pBTFirmware);
		if (pBTFirmware)
			rtw_mfree((u8*)pBTFirmware, sizeof(RT_MP_FIRMWARE));
			
		DBG_871X("Wait for FirmwareDownloadBT fw boot!\n");
		rtw_msleep_os(2000);
		_rtw_memset(extra,'\0', wrqu->data.length);
		BtReq.opCodeVer = 1;
		BtReq.OpCode = 0;
		BtReq.paraLength = 0;
		mptbt_BtControlProcess(padapter, &BtReq);
		rtw_msleep_os(100);

		DBG_8192C("FirmwareDownloadBT ready = 0x%x 0x%x", pMptCtx->mptOutBuf[4],pMptCtx->mptOutBuf[5]);
		if( (pMptCtx->mptOutBuf[4]==0x00) && (pMptCtx->mptOutBuf[5]==0x00))
			{
				if(padapter->mppriv.bTxBufCkFail==_TRUE)
					sprintf(extra, "check TxBuf Fail.\n");
				else
					sprintf(extra, "download FW Fail.\n");
			}
			else
			{
				sprintf(extra, "download FW OK.\n");
				goto exit;
			}
		goto exit;
		goto exit;	
	}
	if ( strncmp(extra, "dlfw", 4) == 0)
	{
		#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_HaltNotify(padapter);
		rtw_btcoex_SetManualControl(padapter, _TRUE);
		#endif
		pHalData->LastHMEBoxNum=0;
		padapter->bBTFWReady = _FALSE;
		rtw_write8(padapter, 0xa3, 0x05);
		BTStatus=rtw_read8(padapter, 0xa0);
		DBG_871X("%s: btwmap before read 0xa0 BT Status =0x%x \n", __FUNCTION__,BTStatus);
		if (BTStatus != 0x04)
		{
			sprintf(extra, "BT Status not Active DLFW FAIL\n");
			goto exit;
		}

		tempval = rtw_read8(padapter, 0x6B);
		tempval |= BIT7;
		rtw_write8(padapter, 0x6B, tempval);

		rtw_usleep_os(100);
		tempval = rtw_read8(padapter, 0x6B);
		tempval &= ~BIT6;
		rtw_write8(padapter, 0x6B, tempval);
		rtw_usleep_os(100);
	
		MPT_PwrCtlDM(padapter,0);
		rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)| 0x00000004));
		rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)& 0xFFFFFFEF));
		rtw_msleep_os(600);
		rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)| 0x00000010));
		rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)& 0xFFFFFFFB));
		rtw_msleep_os(1200);

#if defined(CONFIG_PLATFORM_SPRD) && (MP_DRIVER == 1)
		DBG_871X("%s: pull up BT reset pin when bt start mp test\n", __FUNCTION__);
		rtw_wifi_gpio_wlan_ctrl(WLAN_BT_PWDN_ON);
#endif
		DBG_871X(" rtl8723a_FirmwareDownload!\n");

#ifdef CONFIG_RTL8723A
		status = rtl8723a_FirmwareDownload(padapter);
#elif defined(CONFIG_RTL8723B)
		status = rtl8723b_FirmwareDownload(padapter, _FALSE);
#endif
		DBG_871X("Wait for FirmwareDownloadBT fw boot!\n");
		rtw_msleep_os(1000);
		_rtw_memset(extra,'\0', wrqu->data.length);
		BtReq.opCodeVer = 1;
		BtReq.OpCode = 0;
		BtReq.paraLength = 0;
		mptbt_BtControlProcess(padapter, &BtReq);
		rtw_msleep_os(200);

		DBG_8192C("FirmwareDownloadBT ready = 0x%x 0x%x", pMptCtx->mptOutBuf[4],pMptCtx->mptOutBuf[5]);
		if( (pMptCtx->mptOutBuf[4]==0x00) && (pMptCtx->mptOutBuf[5]==0x00))
			{
				if(padapter->mppriv.bTxBufCkFail==_TRUE)
					sprintf(extra, "check TxBuf Fail.\n");
				else
					sprintf(extra, "download FW Fail.\n");
			}
			else
			{
				#ifdef CONFIG_BT_COEXIST
				rtw_btcoex_SwitchGntBt(padapter);
				#endif
				rtw_msleep_os(200);
				sprintf(extra, "download FW OK.\n");
				goto exit;
			}
		goto exit;
	}

	if ( strncmp(extra, "down", 4) == 0){
		DBG_871X("SetBT down for to hal_init !\n");
		mp_stop_test(padapter);
		pHalFunc->hal_init(padapter);
		mp_start_test(padapter);
		MPT_PwrCtlDM(padapter,0);
		rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)| 0x00000004));
		rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)& 0xFFFFFFEF));
		rtw_msleep_os(600);
		rtw_write32(padapter, 0x6b, (rtw_read32(padapter, 0x6b)| 0x00000010));
		rtw_write32(padapter, 0xcc, (rtw_read32(padapter, 0xcc)& 0xFFFFFFFB));
		rtw_msleep_os(1200);
		goto exit;
	}
	if ( strncmp(extra, "disable", 7) == 0){
		DBG_871X("SetBT disable !\n");
		rtw_write32(padapter, 0x6a, (rtw_read32(padapter, 0x6a)& 0xFFFFFFFB));
		rtw_msleep_os(500);
		goto exit;
		}
	if ( strncmp(extra, "enable", 6) == 0){
		DBG_871X("SetBT enable !\n");
		rtw_write32(padapter, 0x6a, (rtw_read32(padapter, 0x6a)| 0x00000004));
		rtw_msleep_os(500);
		goto exit;
	}
	if ( strncmp(extra, "h2c", 3) == 0){
			DBG_871X("SetBT h2c !\n");
			padapter->bBTFWReady = _TRUE;
			FillH2CCmd(padapter, 0x63, 1, u1H2CBtMpOperParm);
			goto exit;
		}
	if ( strncmp(extra, "2ant", 4) == 0){
		DBG_871X("Set BT 2ant use!\n");
		PHY_SetMacReg(padapter,0x67,BIT5,0x1);
		rtw_write32(padapter, 0x948, 0000);
		
		goto exit;
	}
		
	if( ready!=0 && testmode!=0 && trxparam!=0 && setgen!=0 && getgen!=0 && testctrl!=0 && testbt!=0 && readtherm!=0 &&setbtmac!=0)
		return -EFAULT;
		
	if( testbt==0 )
	{
			BtReq.opCodeVer=1;
			BtReq.OpCode=6;
			BtReq.paraLength=cnts/2;
			goto todo;
	}
	if( ready==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=0;
		BtReq.paraLength=0; 
		goto todo;
	}

	pch = extra;	
	i = 0;
	while ((token = strsep(&pch, ",")) != NULL)
	{
		if (i > 1) break;
		tmp[i] = token;
		i++;
	}

	if ((tmp[0]==NULL) && (tmp[1]==NULL))
	{
		return -EFAULT;
	}
	else
	{
		cnts = strlen(tmp[1]);
		if (cnts<1) return -EFAULT;
	
