jevois/jevois-sdk/linux-3.4/drivers/net/wireless/rtl8723bs/os_dep/linux/ioctl_linux.c
		DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
		DBG_871X("%s: data=%s\n", __FUNCTION__, tmp[1]);
				
		for (jj=0, kk=0; jj<cnts; jj++, kk+=2)
		{
			BtReq.pParamStart[jj] = key_2char2num(tmp[1][kk], tmp[1][kk+1]);
		}
	}
	
	if( testmode==0 )	
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=1;
		BtReq.paraLength=1; 
	}
	if( trxparam==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=2;
		BtReq.paraLength=cnts/2; 
	}
	if( setgen==0 )
	{	
		DBG_871X("%s: BT_SET_GENERAL \n", __func__); 
		BtReq.opCodeVer=1;
		BtReq.OpCode=3;
		BtReq.paraLength=cnts/2;	
	}
	if( getgen==0 )
	{	
		DBG_871X("%s: BT_GET_GENERAL \n", __func__); 
		BtReq.opCodeVer=1;
		BtReq.OpCode=4;	
		BtReq.paraLength=cnts/2;	
	}
	if( readtherm==0 )
	{	
		DBG_871X("%s: BT_GET_GENERAL \n", __func__); 
		BtReq.opCodeVer=1;
		BtReq.OpCode=4;	
		BtReq.paraLength=cnts/2;	
	}
	
	if( testctrl==0 )
	{	
		DBG_871X("%s: BT_TEST_CTRL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=5;	
		BtReq.paraLength=cnts/2;	
	}

	DBG_871X("%s: Req opCodeVer=%d OpCode=%d paraLength=%d\n",
		__FUNCTION__, BtReq.opCodeVer, BtReq.OpCode, BtReq.paraLength);

	if(BtReq.paraLength<1)
		goto todo;
	for (i=0; i<BtReq.paraLength; i++)
	{
		DBG_871X("%s: BtReq.pParamStart[%d] = 0x%02x \n",
			__FUNCTION__, i, BtReq.pParamStart[i]);
	}
	
todo:
	_rtw_memset(extra,'\0', wrqu->data.length);

	if (padapter->bBTFWReady == _FALSE)
	{
		sprintf(extra, "BTFWReady = FALSE.\n");
		goto exit;
	}

	mptbt_BtControlProcess(padapter, &BtReq);

	if (readtherm == 0)
	{
		sprintf(extra, "BT thermal=");
		for (i=4; i<pMptCtx->mptOutLen; i++)
		{
			if ((pMptCtx->mptOutBuf[i]==0x00) && (pMptCtx->mptOutBuf[i+1]==0x00))
				goto exit;

#ifdef CONFIG_RTL8723A
			sprintf(extra, "%s %d ", extra, (pMptCtx->mptOutBuf[i]& 0x3f));
#else
			sprintf(extra, "%s %d ", extra, (pMptCtx->mptOutBuf[i]& 0x1f));
#endif
		}
	}
	else
	{
		for (i=4; i<pMptCtx->mptOutLen; i++)
		{
			sprintf(extra, "%s 0x%x ", extra, pMptCtx->mptOutBuf[i]);
		}
	}
	
exit:
	wrqu->data.length = strlen(extra) + 1;
	DBG_871X("-%s: output len=%d data=%s\n", __FUNCTION__, wrqu->data.length, extra);

	return status;
}

#endif

static int rtw_mp_set(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu = (struct iw_point *)wdata;
	u32 subcmd = wrqu->flags;
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (padapter == NULL)
	{
		return -ENETDOWN;
	}

	if((padapter->bup == _FALSE ))
	{
		DBG_871X(" %s fail =>(padapter->bup == _FALSE )\n",__FUNCTION__);
		return -ENETDOWN;
	}

	if( (padapter->bSurpriseRemoved == _TRUE) || ( padapter->bDriverStopped == _TRUE))
       {	
       	DBG_871X("%s fail =>(padapter->bSurpriseRemoved == _TRUE) || ( padapter->bDriverStopped == _TRUE) \n",__FUNCTION__);
             return -ENETDOWN;
       }

	

	if (extra == NULL)
	{
		wrqu->length = 0;
		return -EIO;
	}

	switch(subcmd)
	{
	case MP_START:
			DBG_871X("set case mp_start \n");
			rtw_mp_start (dev,info,wrqu,extra);
			 break; 
			 
	case MP_STOP:
			DBG_871X("set case mp_stop \n");
			rtw_mp_stop (dev,info,wrqu,extra);
			 break; 
			 
	case MP_BANDWIDTH:
			DBG_871X("set case mp_bandwidth \n");
			rtw_mp_bandwidth (dev,info,wrqu,extra);
			break;
				
	case MP_RESET_STATS:
			DBG_871X("set case MP_RESET_STATS \n");
			rtw_mp_reset_stats	(dev,info,wrqu,extra);
			break;
	case MP_SetRFPathSwh:		
			DBG_871X("set MP_SetRFPathSwitch \n");
			rtw_mp_SetRFPath  (dev,info,wdata,extra);
			break;
	case CTA_TEST:
			DBG_871X("set CTA_TEST\n");
			rtw_cta_test_start (dev, info, wdata, extra);
			break;
	case MP_DISABLE_BT_COEXIST:
			DBG_871X("set case MP_DISABLE_BT_COEXIST \n");
			rtw_mp_disable_bt_coexist(dev, info, wdata, extra);
		break;
#ifdef CONFIG_AP_WOWLAN
	case MP_AP_WOW_ENABLE:
			DBG_871X("set case MP_AP_WOW_ENABLE: %s \n", extra);
			rtw_ap_wowlan_ctrl(dev, info, wdata, extra);
	break;
#endif
	}

	  
	return 0;		
}


static int rtw_mp_get(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu = (struct iw_point *)wdata;
	u32 subcmd = wrqu->flags;
	PADAPTER padapter = rtw_netdev_priv(dev);


	if (padapter == NULL)
	{
		return -ENETDOWN;
	}
	if((padapter->bup == _FALSE ))
	{
		DBG_871X(" %s fail =>(padapter->bup == _FALSE )\n",__FUNCTION__);
		return -ENETDOWN;
	}

	if( (padapter->bSurpriseRemoved == _TRUE) || ( padapter->bDriverStopped == _TRUE))
       {	
       	DBG_871X("%s fail =>(padapter->bSurpriseRemoved == _TRUE) || ( padapter->bDriverStopped == _TRUE) \n",__FUNCTION__);
             return -ENETDOWN;
       }
	
	if (extra == NULL)
	{
		wrqu->length = 0;
		return -EIO;
	}
	
	switch(subcmd)
	{
	case WRITE_REG :
			rtw_mp_write_reg (dev,info,wrqu,extra);
			 break;
			 
	case WRITE_RF:
			rtw_mp_write_rf (dev,info,wrqu,extra);
			 break; 
			 
	case MP_PHYPARA:
			DBG_871X("mp_get  MP_PHYPARA \n");
			rtw_mp_phypara(dev,info,wrqu,extra);	
			break;

	case MP_CHANNEL:
			DBG_871X("set case mp_channel \n");
			rtw_mp_channel (dev,info,wrqu,extra);
			break;
			
	case READ_REG:
			DBG_871X("mp_get  READ_REG \n");
			rtw_mp_read_reg (dev,info,wrqu,extra);
			 break; 
	case READ_RF:
			DBG_871X("mp_get  READ_RF \n");
			rtw_mp_read_rf (dev,info,wrqu,extra);
			break; 
			
	case MP_RATE:
			DBG_871X("set case mp_rate \n");
			rtw_mp_rate (dev,info,wrqu,extra);
			break;
			
	case MP_TXPOWER:
			DBG_871X("set case MP_TXPOWER \n");
			rtw_mp_txpower (dev,info,wrqu,extra);
			break;
			
	case MP_ANT_TX:
			DBG_871X("set case MP_ANT_TX \n");
			rtw_mp_ant_tx (dev,info,wrqu,extra);
			break;
			
	case MP_ANT_RX:
			DBG_871X("set case MP_ANT_RX \n");
			rtw_mp_ant_rx (dev,info,wrqu,extra);
			break;
			
	case MP_QUERY:
			rtw_mp_trx_query(dev,info,wrqu,extra);
			break;
					
	case MP_CTX:
			DBG_871X("set case MP_CTX \n");
			rtw_mp_ctx (dev,info,wrqu,extra);
			break;
			
	case MP_ARX:
			DBG_871X("set case MP_ARX \n");
			rtw_mp_arx (dev,info,wrqu,extra);
			break;
			
	case EFUSE_GET:
			DBG_871X("efuse get EFUSE_GET \n");
			rtw_mp_efuse_get(dev,info,wdata,extra);
		 break; 
		 
	case MP_DUMP:
			DBG_871X("set case MP_DUMP \n");
			rtw_mp_dump (dev,info,wrqu,extra);
		 break; 
	case MP_PSD:
			DBG_871X("set case MP_PSD \n");
			rtw_mp_psd (dev,info,wrqu,extra);
		 break;
	case MP_THER:
			DBG_871X("set case MP_THER \n");
			rtw_mp_thermal (dev,info,wrqu,extra);
		break;
	case MP_PwrCtlDM:
			DBG_871X("set MP_PwrCtlDM\n");
			rtw_mp_PwrCtlDM (dev,info,wrqu,extra);
		break;
	case MP_QueryDrvStats:		
			DBG_871X("mp_get MP_QueryDrvStats \n");
			rtw_mp_QueryDrv(dev,info,wdata,extra);
			break;
		case MP_PWRTRK:
			DBG_871X("set case MP_PWRTRK \n");
			rtw_mp_pwrtrk(dev,info,wrqu,extra);
			break;			 
	case EFUSE_SET:
			DBG_871X("set case efuse set \n");
			rtw_mp_efuse_set(dev,info,wdata,extra);
			break;			 
	case MP_GET_TXPOWER_INX:
			DBG_871X("mp_get MP_GET_TXPOWER_INX \n");
			rtw_mp_txpower_index(dev,info,wrqu,extra);
		break;

#if defined(CONFIG_RTL8723A) || defined(CONFIG_RTL8723B)
	case MP_SetBT:		
			DBG_871X("set MP_SetBT \n");
			rtw_mp_SetBT(dev,info,wdata,extra);
			break;		 
#endif

